tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "git"
brew "graphviz"
brew "htop"
brew "tcl-tk"
brew "imagemagick"
brew "jq"
brew "llvm"
brew "r"
brew "rename"
brew "stow"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "rbenv"
brew "ruby-build"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace"

# Some vim plugins require python3.
brew "vim"
brew "python3"

# For https://github.com/junegunn/fzf.vim
brew "fzf"
brew "ripgrep"

# Alacritty
brew cask install alacritty
